# -*- mode: ruby-ts;-*-
tap "babashka/brew"
tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"

brew "borkdude/brew/babashka"
brew "babashka/brew/neil"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "clojure/tools/clojure"

## Work-specific tools
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

brew "awscli"
brew "bazelisk"
brew "composer"
brew "php@8.2"
brew "php-cs-fixer"
brew "postgresql@15"
brew "python@3.10"

cask "chromium", args: {"no-quarantine": true}
cask "cljstyle"

## Common tools
brew "age"
brew "aspell"
brew "bash-language-server"
brew "bat"
brew "emacs-plus", args: ["with-native-comp"]
brew "enchant" # For jinx module build
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
# For the emacs-plus build
brew "gcc"
brew "gh"
brew "htop"
brew "jq"
# For the system Java wrappers to find this JDK, symlink it with
#   sudo ln -sfn /opt/homebrew/opt/openjdk/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk.jdk
brew "openjdk"
brew "leiningen"
brew "mas"
brew "pkg-config" # For jinx module build
brew "ripgrep"
brew "shellcheck"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "watch"

cask "1password"
cask "alacritty", args: {"no-quarantine": true}
cask "alfred"
cask "arc"
cask "daisydisk"
cask "dash"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "monitorcontrol"
cask "obsidian"
cask "plexamp"
cask "rectangle"
cask "slack"
cask "spotify"
cask "sublime-merge"

mas "Things", id: 904280696
