# -*- mode: ruby-ts;-*-
tap "babashka/brew"
tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "jimeh/emacs-builds"

brew "borkdude/brew/babashka"
brew "babashka/brew/neil"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "clojure/tools/clojure"

## Work-specific tools
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

brew "awscli"
brew "bazelisk"
brew "buildifier"
brew "clj-kondo"
brew "composer"
brew "ibazel" # Bazel builds on file changes
brew "php@8.2"
brew "php-cs-fixer"
brew "postgresql@15", link: true
brew "python@3.10"
brew "python-lsp-server"
brew "sql-formatter"
brew "typescript-language-server"
brew "yarn"

cask "chromium", args: {"no-quarantine": true}
cask "cljstyle"

## Common tools
brew "aspell"
brew "bash"
brew "bash-language-server"
brew "bat"
brew "coreutils" # timeout
brew "enchant" # For jinx module build
brew "eza"
brew "fd"
brew "fish"
brew "fish-lsp"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "gitu"
brew "htop"
brew "helix"
brew "jj"
brew "jq"
# For the system Java wrappers to find this JDK, symlink it with
#   sudo ln -sfn /opt/homebrew/opt/openjdk/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk.jdk
brew "openjdk"
brew "mas"
brew "pkg-config" # For jinx module build
brew "ripgrep"
brew "shellcheck"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "watch"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "daisydisk"
cask "dash"
cask "discord"
cask "font-hack-nerd-font"
cask "ghostty"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "jimeh/emacs-builds/emacs-app"
cask "launchcontrol"
cask "lunar"
cask "netnewswire"
cask "obsidian"
cask "plexamp"
cask "rectangle"
cask "slack"

mas "GoodLinks", id: 1474335294
mas "Things", id: 904280696
