# -*- mode: ruby-ts;-*-
tap 'babashka/brew'
tap 'borkdude/brew'
tap 'clojure-lsp/brew'
tap 'clojure/tools'
tap 'codecrafters-io/tap'
tap 'jimeh/emacs-builds'
tap 'nextjournal/brew'
tap 'siderolabs/tap'

brew 'borkdude/brew/babashka'
brew 'babashka/brew/neil'
brew 'clojure-lsp/brew/clojure-lsp-native'
brew 'clojure/tools/clojure'
brew 'codecrafters-io/tap/codecrafters'

brew 'arduino-cli'
brew 'aspell'
brew 'ast-grep'
brew 'bash-language-server'
brew 'bat'
brew 'cargo-binstall'
brew 'coreutils' # timeout
brew 'enchant' # For jinx module build
brew 'esptool'
brew 'exercism'
brew 'eza'
brew 'fd'
brew 'ffmpeg' # For yt-dlp
brew 'fish'
brew 'fish-lsp'
brew 'fisher'
brew 'fzf'
brew 'git'
brew 'gitu'
brew 'gh'
# For the emacs-plus build, native-comp, and the jinx module
brew 'gcc'
brew 'go'
brew 'golangci-lint'
brew 'gopls'
brew 'helix'
brew 'htop'
brew 'jj'
brew 'jq'
brew 'k9s'
brew 'kubectl'
brew 'openjdk'
brew 'leiningen'
brew 'mas'
brew 'neovim'
brew 'pkg-config' # For jinx module build
brew 'ripgrep'
brew 'rust'
brew 'shellcheck'
brew 'solargraph'
brew 'talosctl'
brew 'terminal-notifier'
brew 'tmux'
brew 'tokei'
brew 'uv'
brew 'watch'
brew 'yt-dlp'
brew 'zig'
brew 'zls'

cask '1password'
cask 'alfred'
cask 'arduino-ide'
cask 'arq'
cask 'balenaetcher'
cask 'calibre'
cask 'claude'
cask 'claude-code'
cask 'daisydisk'
cask 'dash'
cask 'discord'
cask 'font-hack-nerd-font'
cask 'ghostty'
cask 'helium-browser'
cask 'istat-menus'
cask 'jimeh/emacs-builds/emacs-app'
cask 'launchcontrol'
cask 'lunar'
cask 'netnewswire'
cask 'obsidian'
cask 'openaudible'
cask 'plexamp'
cask 'rectangle'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'transmit'
cask 'zed'

mas 'GoodLinks', id: 1_474_335_294
mas 'Ivory', id: 6_444_602_274
mas 'Parcel', id: 375_589_283
mas 'Things', id: 904_280_696
