# -*- mode: ruby-ts;-*-
tap "babashka/brew"
tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "codecrafters-io/tap"
tap "nextjournal/brew"

brew "borkdude/brew/babashka"
brew "babashka/brew/neil"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "clojure/tools/clojure"
brew "codecrafters-io/tap/codecrafters"

brew "aspell"
brew "bash-language-server"
brew "bat"
brew "coreutils" # timeout
brew "enchant" # For jinx module build
brew "exercism"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "nextjournal/brew/garden"
# For the emacs-plus build, native-comp, and the jinx module
brew "gcc"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "htop"
brew "jq"
brew "ollama"
brew "openjdk"
brew "leiningen"
brew "mas"
brew "pkg-config" # For jinx module build
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "watch"

cask "1password"
cask "1password-cli"
cask "alacritty", args: {"no-quarantine": true}
cask "alfred"
cask "arc"
cask "arq"
cask "balenaetcher"
cask "calibre"
cask "daisydisk"
cask "dash"
cask "discord"
cask "emacs"
cask "font-hack-nerd-font"
cask "ghostty"
cask "istat-menus"
cask "launchcontrol"
cask "monitorcontrol"
cask "netnewswire"
cask "obsidian"
cask "openaudible"
cask "plexamp"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "syncthing"
cask "transmission"
cask "transmit"
cask "zed"

mas "GoodLinks", id: 1474335294
mas "Ivory", id: 6444602274
mas "Kiwix", id: 997079563
mas "Parcel", id: 639968404
mas "Things", id: 904280696
